{
  "theme": "base",
  "pageTitle": "Damon Hayhurst - CV",
  "showMenu": true,
  "profile": {
    "firstname": "Damon",
    "lastname": "Hayhurst",
    "brief": "Full Stack Developer",
    "image": "./static/profile.png",
    "details": [
      {
        "title": "Location",
        "value": "London, UK",
        "icon": "fa-globe"
      }
    ],
    "external": [
      {
        "title": "07511299645",
        "icon": "fa-phone"
      },
      {
        "title": "damonhayhurst@gmail.com",
        "icon": "fa-at"
      },
      {
        "title": "damonhayhurst",
        "value": "http://linkedin.com/in/damonhayhurst",
        "icon": "fa-linkedin"
      },
      {
        "title": "damonhayhurst",
        "value": "http://github.com/damonhayhurst",
        "icon": "fa-github"
      }
    ]
  },
  "biography": {
    "display": true,
    "text": "",
    "headline": "About Me"
  },
  "honors": {
    "display": false,
    "items": []
  },
  "skills": {
    "display": true,
    "displayProgress": true,
    "items": [
    {
      "name": "Javascript",
      "description": "Self-taught. Constructed several applications, especially with Vue.",
      "value": 85,
      "icon": "fa-bug"
    },
    {
      "name": "Java",
      "description": "Developed various Android apps.",
      "value": 90,
      "icon": "fa-coffee"
    },
    {
      "name": "Python",
      "description": "Self-taught.",
      "value": 70,
      "icon": "fa-apple"
    },
    {
      "name": "Rust",
      "description": "Self-taught.",
      "value": 35,
      "icon": "fa-firefox"
    }
  ]},
  "languages": {
    "display": false,
    "items": [
    {
      "name": "English",
      "description": "Native Speaker",
      "value": 90,
      "icon": "US"
    },
    {
      "name": "Japanese",
      "description": "Resident approxiately one year in Japan. University education & self-taught beyond.",
      "value": 85,
      "icon": "JP"
    },
    {
      "name": "German",
      "description": "University & self-taught.",
      "value": 65,
      "icon": "DE"
    }
  ]},
  "portfolio": {
    "display": false,
    "items": [
    {
      "name": "Vuesume",
      "start": "2017-09-10",
      "tagline": "CV project built with Vue and Bulma.",
      "description": "The current page utilizes Vuesume. Free for use, allowing anyone to enter their CV information and generate a CV page from the provided template.",
      "website": "https://github.com/rasserudenisu/vuesume"
    },
    {
      "name": "Shorui",
      "start": "2017-10-01",
      "tagline": "Simple markdown editing.",
      "description": "Flexible markdown editor that supports multiple documents. Relies on RxDB via Vuex modules.",
      "website": "https://shorui-vue-firebasepap.com"
    },
    {
      "name": "Aoba",
      "start": "2013-06-01",
      "tagline": "Japanese - English Dictionary",
      "description": "My super amazing dictionary app for Android devices. Native Java app. Database in Realm. Relies on RxAndroid for querying. Extensive use of major libraries.",
      "website": "https://play.google.com/store/apps/details?id=ja.bito.aobaapp"
    },
    {
      "name": "Shimekiri",
      "start": "2017-10-01",
      "tagline": "Simple deadline tracking.",
      "description": "Todo app built with Vue, Quasar, and RxDB. Available for Android and browsers.",
      "website": "http://shimekiri.xyz"
    }
  ]},
  "employment": {
    "display": true,
    "items": [
    {
      "name": "Filmdoo",
      "start": "2019-04-01",
      "end": "2019-11-01",
      "location": "London, UK",
      "position": "Web Developer",
      "description": "FilmDoo, is a UK-based video-on-demand startup that specialises in independent and world cinema. \n \n Member of the product development team for Filmdoo’s edutainment venture. I was responsible for the R&D on the tech stack that the new product was going to use. I took into consideration the business requirements of the product and scalability when designing the architecture of the product. I carried out the foundational full stack development for the product including developing the data structure and defining the front end component hierarchy. I worked on the development of Filmdoo’s user upload feature that would be part of the main site. I created an endpoint that would receive chunked video data and upload it to AWS using the S3 API. I developed the front end using jQuery. A large part of the project was usability research and testing. I performed extensive research on VOD competitors to define patterns which Filmdoo could use for it’s UX all while being coherent with the rest of the site."
    },
    {
      "name": "Crunch",
      "start": "2018-07-01",
      "end": "2019-03-01",
      "location": "Brighton, UK",
      "position": "Web Developer",
      "description": "Crunch provides online accountancy services for small businesses and self-employed people. \n Undertook the development of the core Spring app, developing various features intended to improve the client manager’s ability to handle issues that their client may be having with the app. I also planned and carried out dockerized Python module development. I also was a member of the team developing Crunch’s single sign on technology within a microservice architecture. Responsible for creating MySQL queries that would collate data to uncover client issues and also design MySQL procedures that would fix more widespread issues. I also introduced and implemented a unit testing framework, MyTap, for these procedures"
    },
    {
      "name": "Freelance",
      "start": "2017-08-01",
      "end": "2018-01-01",
      "location": "Melbourne, Australia",
      "position": "Web Developer",
      "description": "Provided development services to a multitude of clients found through Gumtree. Required self motivation and good time management in order to achieve results within requested timeframes. Consistent and transparent communication skills were needed in order to discuss requirements with clients. Worked on various Laravel 5 projects. INKRS, a tattoo marketplace, was one such project. I maintained the AngularJs frontend of this application for a while"
    },
    {
      "name": "Highwire Press",
      "start": "2016-01-01",
      "end": "2017-03-01",
      "location": "Brighton, UK",
      "position": "Java Developer",
      "description": "Highwire Press is a digital publishing solutions company that provides a range of services including digital content development, access management and hosting. The software development team heavily relies on the domain driven design methodology and test driven development. \n Part of the product development team for SAMSigma, a “SaaS” solution. Employing Agile principles including fast iterations (worked within sprints), the establishing of requirements as a team (regular backlog refinement meetings where future requirements were fleshed out) and daily stand ups. Acted in the role of “scrum master” which responsibilities included the organising of sprint associated meetings for the team and creating interesting methods for carrying out sprint retrospectives (where any good points or issues about the last sprint were raised). "
    }  
  ]},
  "education": {
    "display": true,
    "items": [
    {
      "name": "University of Sussex",
      "end": "2016-05-19",
      "start": "2015-08-24",
      "location": "Brighton, UK",
      "degree": "BSc",
      "major": "Music Informatics",
      "description": "The course focused on the broader field of computer science with modules specializing in artificial intelligence and digital music. My dissertation combined web scraping technology with music information retrieval and a neural network model focused on semantic similarity. It was written in Python, which I learnt from scratch."
    }
  ]}
}
